ShellAlbert/DroneCatcher/STM32/DroneCatcher/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32h7xx_hal_tim.h"
#include <string.h>
#include <stdio.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

CRC_HandleTypeDef hcrc;

RTC_HandleTypeDef hrtc;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim17;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart3;
DMA_HandleTypeDef hdma_usart1_tx;
DMA_HandleTypeDef hdma_usart1_rx;

/* Definitions for defaultTask */
osThreadId_t defaultTaskHandle;
const osThreadAttr_t defaultTask_attributes = {
  .name = "defaultTask",
  .priority = (osPriority_t) osPriorityNormal,
  .stack_size = 128 * 4
};
/* Definitions for commTask */
osThreadId_t commTaskHandle;
const osThreadAttr_t commTask_attributes = {
  .name = "commTask",
  .priority = (osPriority_t) osPriorityAboveNormal,
  .stack_size = 128 * 4
};
/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_ADC1_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM17_Init(void);
static void MX_CRC_Init(void);
static void MX_USART3_UART_Init(void);
void StartDefaultTask(void *argument);
void commTaskEntry(void *argument);

/* USER CODE BEGIN PFP */
typedef enum
{
	FSM_Stop=0,
	FSM_GetBack=1,
	FSM_ThrowOut=2,
}TFSMState;
TFSMState gFSMState=FSM_Stop;
//dir=1:GetBack,dir=0:ThrowOut.
void motor_ctl_with_timeout(TFSMState state)
{
	switch(state)
	{
	case FSM_Stop:
		//ShutDown: enable(1),disable(0).
		HAL_GPIO_WritePin(GPIOG, MOTOR1_SD_Pin, GPIO_PIN_RESET);
		//stop TIM17.
		HAL_TIM_Base_Stop_IT(&htim17);

		//set variable.
		gFSMState=FSM_Stop;
		break;
	case FSM_GetBack:
		//ShutDown: enable(1),disable(0).
		HAL_GPIO_WritePin(GPIOG, MOTOR1_SD_Pin, GPIO_PIN_RESET);
		//GetBack.
		//top arm driven with pwm.
		__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_1,2);// CCR/ARR=2/5=40%.
		//bottom arm driven with 0,always on.
		__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_2,0);// CCR/ARR=0/5=0%.
		//ShutDown: enable(1),disable(0).
		HAL_GPIO_WritePin(GPIOG, MOTOR1_SD_Pin, GPIO_PIN_SET);

		//start timer17 to timeout to stop pwm.
		HAL_TIM_Base_Start_IT(&htim17);

		//set variable.
		gFSMState=FSM_GetBack;
		break;
	case FSM_ThrowOut:
		//ShutDown: enable(1),disable(0).
		HAL_GPIO_WritePin(GPIOG, MOTOR1_SD_Pin, GPIO_PIN_RESET);
		//ThrowOut.
		__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_1,0);// CCR/ARR=0/5=0%.
		__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_2,2);// CCR/ARR=2/5=40%.
		//ShutDown: enable(1),disable(0).
		HAL_GPIO_WritePin(GPIOG, MOTOR1_SD_Pin, GPIO_PIN_SET);

		//start timer17 to timeout to stop pwm.
		HAL_TIM_Base_Start_IT(&htim17);

		//set variable.
		gFSMState=FSM_ThrowOut;
		break;
	}
}
//dir=1:GetBack,dir=0:ThrowOut.
void motor_ctl_always(TFSMState state)
{
	switch(state)
	{
	case FSM_Stop:
		//ShutDown: enable(1),disable(0).
		HAL_GPIO_WritePin(GPIOG, MOTOR1_SD_Pin, GPIO_PIN_RESET);
		//stop TIM17.
		HAL_TIM_Base_Stop_IT(&htim17);

		//set variable.
		gFSMState=FSM_Stop;
		break;
	case FSM_GetBack:
		//ShutDown: enable(1),disable(0).
		HAL_GPIO_WritePin(GPIOG, MOTOR1_SD_Pin, GPIO_PIN_RESET);
		//GetBack.
		//top arm driven with pwm.
		__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_1,2);// CCR/ARR=2/5=40%.
		//bottom arm driven with 0,always on.
		__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_2,0);// CCR/ARR=0/5=0%.
		//ShutDown: enable(1),disable(0).
		HAL_GPIO_WritePin(GPIOG, MOTOR1_SD_Pin, GPIO_PIN_SET);

		//set variable.
		gFSMState=FSM_GetBack;
		break;
	case FSM_ThrowOut:
		//ShutDown: enable(1),disable(0).
		HAL_GPIO_WritePin(GPIOG, MOTOR1_SD_Pin, GPIO_PIN_RESET);
		//ThrowOut.
		__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_1,0);// CCR/ARR=0/5=0%.
		__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_2,4);// CCR/ARR=4/5=80%.
		//ShutDown: enable(1),disable(0).
		HAL_GPIO_WritePin(GPIOG, MOTOR1_SD_Pin, GPIO_PIN_SET);

		//set variable.
		gFSMState=FSM_ThrowOut;
		break;
	}
}
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
uint8_t uartRxBuffer[64];
uint8_t uartRxLen=0;
uint8_t uartRxFinished=0;
//ADC1-CH5:current
//ADC1-CH9:voltage.
//channel_count=2,DMA buffer size=32.
#define CHANNEL_NUM	2
#define EACH_CHANNEL_SIZE	100
uint32_t adc1_buffer[CHANNEL_NUM*EACH_CHANNEL_SIZE];
//two running modes.
typedef enum{
	Mode_Manual=0,
	Mode_Auto=1,
}RunMode;
RunMode g_RunMode=Mode_Manual;
uint8_t uart3RxBuffer[9];
int32_t g_iPullingSensor=0;
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

