ShellAlbert/DroneCatcher/STM32/DroneCatcher/Core/Src/main.c
}

/* USER CODE BEGIN 4 */
void uartCmdParse(uint8_t *cmd,uint8_t cmdLen)
{
	//return directly to verify if received successfully.
	//HAL_UART_Transmit(&huart1,cmd,cmdLen,200);

	//Sync1 Sync2  Command   DataLen      Data           CRC32
	//5A     A5      01        04      XX XX XX XX     XX XX XX XX
	//Command:01,manual motor rotate control.TIM17 timeout stop.
	//Data:00 00 00 01,manual move clockwise.
	//Data:00 00 00 02,manual move anti-clockwise.

	//Command:02,auto motor rotate control.No stop!
	//Data:00 00 00 01,auto move clockwise.
	//Data:00 00 00 02,auto move anti-clockwise.
	if(cmdLen<12)
	{
		return;
	}else if(cmd[0]!=0x5A || cmd[1]!=0xA5)
	{
		return;
	}
	switch(cmd[2])
	{
	case 0x00://stop motor immediately.
		if(cmd[3]==0x04 && cmd[4]==0x00 && cmd[5]==0x00 && cmd[6]==0x00 &&cmd[7]==0x00)
		{
			//5a a5 00 04 00 00 00 00 00 00 00 00
			motor_ctl_with_timeout(FSM_Stop);
		}
		break;
	case 0x01:
		if(cmd[3]==0x04 && cmd[4]==0x00 && cmd[5]==0x00 && cmd[6]==0x00 &&cmd[7]==0x01)
		{//GetBack with timeout to stop.
			//5a a5 01 04 00 00 00 01 00 00 00 00
			motor_ctl_with_timeout(FSM_GetBack);
		}else if(cmd[3]==0x04 && cmd[4]==0x00 && cmd[5]==0x00 && cmd[6]==0x00 &&cmd[7]==0x02)
		{//ThrowOut with timeout to stop.
			//5a a5 01 04 00 00 00 02 00 00 00 00
			motor_ctl_with_timeout(FSM_ThrowOut);
		}
	case 0x02:
		if(cmd[3]==0x04 && cmd[4]==0x00 && cmd[5]==0x00 && cmd[6]==0x00 && cmd[7]==0x01)
		{//GetBack always.
			//5a a5 02 04 00 00 00 01 00 00 00 00
			motor_ctl_always(FSM_GetBack);
		}else if(cmd[3]==0x04 && cmd[4]==0x00 && cmd[5]==0x00 && cmd[6]==0x00 && cmd[7]==0x02)
		{//ThrowOut always.
			//5a a5 02 04 00 00 00 02 00 00 00 00
			motor_ctl_always(FSM_ThrowOut);
		}
		break;
	default:
		break;
	}
}
///<summary>
/// 转换成CRC�?
//modbus CRC16
int32_t CRC16Calc(uint8_t* dataBuff,int32_t dataLen)
{
	int32_t CRCResult=0xFFFF;
	if(dataLen<2)
	{
		return -1;
	}
	for(int32_t i=0;i<dataLen;i++)
	{
		CRCResult=CRCResult^dataBuff[i];
		for(int32_t j=0;j<8;j++)
		{
			if((CRCResult & 1) == 1)
			{
				CRCResult = (CRCResult >> 1) ^ 0xA001;
			}
			else {
				CRCResult >>= 1;
			}
		}
	}
	return CRCResult;
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	if(huart->Instance==USART3)
	{
		//01 03 04 00 00 00 00 FA 33
		if(uart3RxBuffer[0]==0x01 && uart3RxBuffer[1]==0x03 && uart3RxBuffer[2]==0x04)
		{
			char buffer[64];
			int32_t iCalcCrc16=CRC16Calc(uart3RxBuffer,7);
			int32_t iRecvCrc16=uart3RxBuffer[8]<<8 | uart3RxBuffer[7]<<0;
			if(iCalcCrc16==iRecvCrc16)
			{
				g_iPullingSensor=uart3RxBuffer[3]<<24 | uart3RxBuffer[4]<<16 | uart3RxBuffer[5]<<8 | uart3RxBuffer[6]<<0;
				sprintf(buffer,"CRC16 Okay:%d\r\n",g_iPullingSensor);
				HAL_UART_Transmit(&huart1,(uint8_t*)buffer,strlen(buffer),1000);
			}else{
				g_iPullingSensor=-1;
				sprintf(buffer,"CRC16 Err,%x!=%x\r\n",(uint32_t)iRecvCrc16,(uint32_t)iCalcCrc16);
				HAL_UART_Transmit(&huart1,(uint8_t*)buffer,strlen(buffer),1000);
			}
		}

	}
}
/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
 * @brief  Function implementing the defaultTask thread.
 * @param  argument: Not used
 * @retval None
 */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument)
{
  /* USER CODE BEGIN 5 */
	/* Infinite loop */
	uint32_t iCounter=0;
	uint8_t iBeepFlag=0;
	for(;;)
	{

		HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET);
		osDelay(200);

		//request to pulling sensor.
		uint8_t cmdRequest[]={0x01,0x03,0x00,0x00,0x00,0x02,0xC4,0x0B};
		HAL_UART_Transmit(&huart3,cmdRequest,sizeof(cmdRequest),1000);

		//////////////////////////////////////////////////
		//use motor current to determine when to stop motor.
#if 1
		//ADC Voltage=Power Voltage/37+1.24
		//16bit ADC, 2^16=65536.
		//ADC Voltage=ADCValue/65536*3.3
		//ADC output is about 25600 while motor isnot running.
		//so here subtract 25600.

		char txBuffer[64];
		uint16_t iEncoder=__HAL_TIM_GET_COUNTER(&htim3);
		//current0,voltage0,current1,voltage1, ... ...
		//do average value filter.
		int iCurMax=0,iCurMin=0x7fffffff,iCurTotal=0,iCurAvg;
		for(int i=0;i<100;i++)
		{
			if((int)adc1_buffer[i*2]>iCurMax)
			{
				iCurMax=(int)adc1_buffer[i*2];
			}
			if((int)adc1_buffer[i*2]<iCurMin)
			{
				iCurMin=(int)adc1_buffer[i*2];
			}
			iCurTotal+=(int)adc1_buffer[i*2];
			//sprintf(txBuffer,"%d-I:%d,E:%d\r\n",i*2,(int)adc1_buffer[i*2],iEncoder);
			//HAL_UART_Transmit(&huart1,(uint8_t*)txBuffer,strlen(txBuffer),200);
		}
		iCurAvg=(iCurTotal-iCurMax-iCurMin)/(100-2);
		//sprintf(txBuffer,"I:%dMax,%dMin,%dAvg,E:%d\r\n",iCurMax,iCurMin,iCurAvg,iEncoder);
		//HAL_UART_Transmit(&huart1,(uint8_t*)txBuffer,strlen(txBuffer),200);

		int real_cur=(iCurAvg-25600)>0?(iCurAvg-25600):0;
		//sprintf(txBuffer,"%dV,%dA,%d\r\n",(int)adc1_buffer[1],real_cur,iEncoder);
		//HAL_UART_Transmit(&huart1,(uint8_t*)txBuffer,strlen(txBuffer),200);
#if 0
		if(gRotateDir==Dir_GetBack && real_cur>350)
		{
			//stop DMA before reverse rotate to avoid big start current.
			HAL_ADC_Stop_DMA(&hadc1);
			motor_on_always(Dir_ThrowOut);
			osDelay(5000);
			//start DMA again.
			motor_on_always(Dir_GetBack);
			osDelay(500);//delay to skip reverse big current.
			memset(adc1_buffer,0,CHANNEL_NUM*EACH_CHANNEL_SIZE*sizeof(uint32_t));
			HAL_ADC_Start_DMA(&hadc1, (uint32_t *)adc1_buffer, CHANNEL_NUM*EACH_CHANNEL_SIZE);
		}
#endif
#endif

		///////////////////////////////////////
		//use Pulling Sensor value to determine when to ThrowOut while GetBack.
		switch(gFSMState)
		{
		case FSM_Stop:
			if(iBeepFlag)
			{//use beep to indicate stop.
				HAL_GPIO_WritePin(GPIOG, BEEP_Pin, GPIO_PIN_SET);
				osDelay(500);
				HAL_GPIO_WritePin(GPIOG, BEEP_Pin, GPIO_PIN_RESET);
				iBeepFlag=0;
			}
			//V:voltage,A:current,E:encoder,T:pulling sensor.
			sprintf(txBuffer,"Stop:%dV,%dA,%dE,%dT\r\n",(int)adc1_buffer[1],real_cur,iEncoder,g_iPullingSensor);
			HAL_UART_Transmit(&huart1,(uint8_t*)txBuffer,strlen(txBuffer),1000);
			break;
		case FSM_GetBack:
			//V:voltage,A:current,E:encoder,T:pulling sensor.
			sprintf(txBuffer,"GetBack:%dV,%dA,%dE,%dT\r\n",(int)adc1_buffer[1],real_cur,iEncoder,g_iPullingSensor);
			HAL_UART_Transmit(&huart1,(uint8_t*)txBuffer,strlen(txBuffer),1000);
			if(real_cur>350)
			{
				//locked-rotor motor current (over current):GetBack done,reach boundary,stop motor.
				motor_ctl_always(FSM_Stop);
				iBeepFlag=1;
			}else if(g_iPullingSensor>400)
			{
				motor_ctl_always(FSM_ThrowOut);
				iCounter=0;
			}
			break;
		case FSM_ThrowOut:
			//V:voltage,A:current,E:encoder,T:pulling sensor.
			sprintf(txBuffer,"ThrowOut:%dV,%dA,%dE,%dT\r\n",(int)adc1_buffer[1],real_cur,iEncoder,g_iPullingSensor);
			HAL_UART_Transmit(&huart1,(uint8_t*)txBuffer,strlen(txBuffer),1000);
			if(iCounter++>10 && g_iPullingSensor<400)
			{
				motor_ctl_always(FSM_GetBack);
			}
			break;
		}

		HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_SET);
		osDelay(200);
	}
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_commTaskEntry */
/**
 * @brief Function implementing the commTask thread.
 * @param argument: Not used
 * @retval None
 */
/* USER CODE END Header_commTaskEntry */
void commTaskEntry(void *argument)
{
  /* USER CODE BEGIN commTaskEntry */
	//start encoder.
	HAL_TIM_Encoder_Start(&htim3,TIM_CHANNEL_1);
	HAL_TIM_Encoder_Start(&htim3,TIM_CHANNEL_2);
	//start PWM.
	HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_1);
	HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_2);
	//start ADC.
	HAL_ADC_Start_DMA(&hadc1, (uint32_t *)adc1_buffer, CHANNEL_NUM*EACH_CHANNEL_SIZE);
	HAL_Delay(1000);
	//	while(1)
	//	{
	//		//ADC Voltage=Power Voltage/37+1.24
	//		//16bit ADC, 2^16=65536.
	//		//ADC Voltage=ADCValue/65536*3.3
	//		char txBuffer[64];
	//		sprintf(txBuffer,"%dV,%dA\r\n",(int)adc1_buffer[1],(int)adc1_buffer[2]);
	//		HAL_UART_Transmit(&huart1,txBuffer,strlen(txBuffer),200);
	//		osDelay(1000);
	//	}
	/* Infinite loop */
	for(;;)
	{
		uint16_t iEncoder;
		uint8_t iBuffer[64];
		uint32_t iCrc32;
		osDelay(10);
		if(uartRxFinished)
		{
			HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET);
			//parse received command.
			uartCmdParse(uartRxBuffer,uartRxLen);
			//reset rx buffer.
			memset(uartRxBuffer,0,sizeof(uartRxBuffer));
			//reset flag.
			uartRxLen=0;
			uartRxFinished=0;
			HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_SET);
		}
		HAL_UART_Receive_DMA(&huart1,uartRxBuffer,64);

		//read encoder value and tx out.
		//iEncoder=__HAL_TIM_GET_COUNTER(&htim3);
		//sprintf((char*)iBuffer,"%d\r\n",iEncoder);
		//HAL_UART_Transmit(&huart1,iBuffer,strlen((char*)iBuffer),200);
		//		iBuffer[0]=0x5a;
		//		iBuffer[1]=0xa5;
		//		iBuffer[2]=0x01;
		//		iBuffer[3]=0x02;
		//		iBuffer[4]=0x03;
		//		iBuffer[5]=0x04;
		//		iBuffer[6]=0x05;
		//		iBuffer[7]=0x06;
		//		iCrc32=HAL_CRC_Calculate(&hcrc,(uint32_t*)iBuffer,2);
		//		sprintf((char*)iBuffer,"crc32=%x\r\n",(unsigned int)iCrc32);
		//		HAL_UART_Transmit(&huart1,iBuffer,strlen((char*)iBuffer),200);
	}
  /* USER CODE END commTaskEntry */
}

 /**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM5 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM5) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */
	else if(htim->Instance== TIM17)
	{
		//HTIM17
		//72MHz/(2000-1+1)=36000Hz
		//36000Hz/(18000-1+1)=2Hz
		//AutoReloadPreloadDisable
		motor_ctl_with_timeout(FSM_Stop);
	}
  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	__disable_irq();
	while (1)
	{
	}
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
